Управление_торговлей.ПБТ/src/Documents/вт_ПоступлениеДавальческогоСырья/вт_ПоступлениеДавальческогоСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ПоступлениеДавальческогоСырья</name>
  <basedOn>Document.ОприходованиеИзлишковТоваров</basedOn>
  <basedOn>Document.ПоступлениеТоваровНаСклад</basedOn>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>String</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВход</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВх</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_ДавальческоеСырьеПолученное/вт_ДавальческоеСырьеПолученное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_ДавальческоеСырьеПолученное</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Documents/вт_ПоступлениеДавальческогоСырья/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров")
		 ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг")
		 ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад")
		 Тогда
		 ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения,"Организация, Партнер,Контрагент,Договор,Склад");
		 для каждого СтрокаТовараИст из  ДанныеЗаполнения.Товары Цикл
			  СтрокаТовара = ЭтотОбъект.Товары.Добавить();
			  ЗаполнитьЗначенияСвойств(СтрокаТовара,СтрокаТовараИст,"Номенклатура,Характеристика,Количество, Сумма"); 
			  Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
				  СтрокаТовара.Сумма = СтрокаТовараИст.СуммаСНДС; 
			  КонецЕсли;
			  
		  КонецЦикла;
		  ДокументОснование = ДанныеЗаполнения;
		  Комментарий = "#на основании#"+Строка(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СвободныеОстатки Приход
	//Движения.СвободныеОстатки.Записывать = Истина;
	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	//	Движение = Движения.СвободныеОстатки.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//	Движение.Характеристика = ТекСтрокаТовары.Характеристика;
	//	Движение.Склад = Склад;
	//	Движение.ВНаличии = ТекСтрокаТовары.Количество;
	//КонецЦикла;



	//// регистр ТоварыНаСкладах Приход
	//Движения.ТоварыНаСкладах.Записывать = Истина;
	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	//	Движение = Движения.ТоварыНаСкладах.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//	Движение.Характеристика = ТекСтрокаТовары.Характеристика;
	//	Движение.Склад = Склад;
	//	Движение.ВНаличии = ТекСтрокаТовары.Количество;
	//КонецЦикла;

	// регистр вт_ДавальческоеСырьеПолученное Приход
	Движения.вт_ДавальческоеСырьеПолученное.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.вт_ДавальческоеСырьеПолученное.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Партнер = Партнер;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

	ДвиженияПоРеглРегистрам();
	
КонецПроцедуры


Функция ПолучитьПервуюСтатьюДоходов()
	Выборка=ПланыВидовХарактеристик.СтатьиДоходов.Выбрать();
	Если Выборка.Следующий() ТОгда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьПервоеПодразделение()
	
	Выборка = Справочники.СтруктураПредприятия.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.СтруктураПредприятия.ПустаяСсылка();
	
КонецФункции	

Функция ПолучитьВидЗапасовДавальца(пОрганизация,пКонтрагент,пДоговор)
	
 Запрос = Новый Запрос("ВЫБРАТЬ
                       |	ВидыЗапасов.Ссылка
                       |ИЗ
                       |	Справочник.ВидыЗапасов КАК ВидыЗапасов
                       |ГДЕ
                       |	ВидыЗапасов.Организация = &Организация
                       |	И ВидыЗапасов.ТипЗапасов = &ТипЗапасов
                       |	И ВидыЗапасов.Контрагент = &Контрагент
                       |	И ВидыЗапасов.Договор = &Договор");	
 Запрос.УстановитьПараметр("Организация",пОрганизация);
 Запрос.УстановитьПараметр("ТипЗапасов",перечисления.ТипыЗапасов.МатериалДавальца);
 Запрос.УстановитьПараметр("Контрагент",пКонтрагент);
 Запрос.УстановитьПараметр("Договор",пДоговор);
 Выборка = Запрос.Выполнить().Выбрать();
 Если Выборка.Следующий() Тогда
	 Возврат Выборка.Ссылка;
 КонецЕсли;	 
 
 НовыйВидЗапасов = Справочники.ВидыЗапасов.СоздатьЭлемент();
 
 НовыйВидЗапасов.Организация = пОрганизация;
 НовыйВидЗапасов.ТипЗапасов = перечисления.ТипыЗапасов.МатериалДавальца;
 НовыйВидЗапасов.НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПоФактическомуИспользованию;
 НовыйВидЗапасов.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
 НовыйВидЗапасов.СпособПередачиТоваров = Перечисления.СпособыПередачиТоваров.ПередачаНаКомиссию;
 НовыйВидЗапасов.Предназначение = Перечисления.ТипыПредназначенияВидовЗапасов.ПредназначенДляЗаказа;
 НовыйВидЗапасов.Контрагент     = пКонтрагент;
 НовыйВидЗапасов.Договор        = пДоговор;
 
 НовыйВидЗапасов.Записать();
 
 Возврат НовыйВидЗапасов.Ссылка;
 
КонецФункции

Процедура ДвиженияПоРеглРегистрам()
	//Возьмем движения по регистрам, аналогичные оприходование товаров
	
	ДокОприходование = Документы.ОприходованиеИзлишковТоваров.СоздатьДокумент();
	ДокОприходование.Дата = Дата;
	ДокОприходование.Склад = Склад;
	ДокОприходование.Организация =  Организация;
	ДокОприходование.Подразделение = ПолучитьПервоеПодразделение();
	ДокОприходование.СтатьяДоходов = ПолучитьПервуюСтатьюДоходов();
	
	ТаблТовары = ЭтотОбъект.Товары.Выгрузить();
	ТаблТовары.Свернуть("Номенклатура,Характеристика","Количество");
	ТаблТовары.Колонки.Добавить("Цена");
	ТаблТовары.Колонки.Добавить("Сумма");
	ТаблТовары.Колонки.Добавить("ВидЗапасов");
	
	ТаблТовары.ЗаполнитьЗначения(1,"Цена");
	ТаблТовары.ЗаполнитьЗначения(1,"Сумма");
//	ТаблТовары.ЗаполнитьЗначения(ПолучитьВидЗапасовДавальца(Организация,Контрагент,Договор),"ВидЗапасов");
	
	ДокОприходование.Товары.Загрузить(ТаблТовары);
	
	ДокОприходование.Записать(РежимЗаписиДокумента.Проведение);
	
	ДвижДокСборка = ДокОприходование.Движения;
	
	МД_ДокСборка = ДокОприходование.метаданные().Движения;
	МД_ЭтотОбъект = ЭтотОбъект.метаданные().Движения;
	МД_Массив = Новый Массив;
	Для каждого МД_СтрЭтотОбъект из МД_ЭтотОбъект цикл
		Для каждого МД_СтрДокСборка из МД_ДокСборка цикл
			Если МД_СтрДокСборка.Имя = МД_СтрЭтотОбъект.Имя тогда
				МД_Массив.Добавить(МД_СтрЭтотОбъект.Имя);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	ДвижСебестоимость = новый ТаблицаЗначений;
	Для каждого ЭлементМД_Массив из МД_Массив цикл
		
		ДвижСебестоимость = ДвижДокСборка[ЭлементМД_Массив].выгрузить();
		ДвижСебестоимость.Колонки.Удалить("Регистратор");
		
			Движения[ЭлементМД_Массив].Записывать = Истина;
			Движения[ЭлементМД_Массив].Загрузить(ДвижСебестоимость);
			
			//Для каждого СтрокаДвижСебестоимость Из ДвижСебестоимость Цикл
			//	НоваяСтрокаДвижСебестоимость = Движения[ЭлементМД_Массив].Добавить();
			//	ЗаполнитьЗначенияСвойств(НоваяСтрокаДвижСебестоимость, СтрокаДвижСебестоимость);
			//КонецЦикла;
		
	КонецЦикла;
	
	Попытка  
		ДокОприходование.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
	КонецПопытки;	
	ДокОприходование.УстановитьПометкуУдаления(Истина);
	
	УдалитьДанныеДокументов(ДокОприходование.Ссылка);
	
	ДокОприходование.ОбменДанными.Загрузка=истина;
	ДокОприходование.Удалить();	
	
КонецПроцедуры	


Процедура УдалитьДанныеДокументов(ДокСсылка)
	НЗ = РегистрыСведений.РеестрДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.Ссылка.Установить(ДокСсылка);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать(Истина);	
КонецПроцедуры
